Patnic93/play_mp3_control_example/sdkconfig.defaults.esp32
CONFIG_IDF_CMAKE=y
CONFIG_IDF_TARGET_ARCH_XTENSA=y
CONFIG_IDF_TARGET="esp32"
CONFIG_IDF_TARGET_ESP32=y
CONFIG_IDF_FIRMWARE_CHIP_ID=0x0000

#
# Audio HAL
#
CONFIG_ESP_LYRAT_V4_3_BOARD=y

# Play MP3 Control: I2C slave control interface (external control header)
# (Front-end master talks to addr 0x42 on LyraT GPIO18/23)
CONFIG_PLAY_MP3_I2C_SLAVE_PORT_1=y
# CONFIG_PLAY_MP3_I2C_SLAVE_PORT_0 is not set
CONFIG_PLAY_MP3_I2C_SLAVE_ADDR=0x42
CONFIG_PLAY_MP3_I2C_SLAVE_SDA_GPIO=15
CONFIG_PLAY_MP3_I2C_SLAVE_SCL_GPIO=14

CONFIG_PLAY_MP3_CTRL_IFACE_UART=y
# CONFIG_PLAY_MP3_CTRL_IFACE_I2C is not set
CONFIG_PLAY_MP3_UART_PORT=1
CONFIG_PLAY_MP3_UART_BAUD=115200
CONFIG_PLAY_MP3_UART_RX_GPIO=14
CONFIG_PLAY_MP3_UART_FRAME_TIMEOUT_MS=50
